#+TITLE: pomodora techniques
#+DESCRIPTION: RT

* TODO test item1 
  CLOCK: [2017-01-13 Fri 16:56]--[2017-01-13 Fri 16:57] =>  0:01
  CLOCK: [2017-01-13 Fri 16:42]--[2017-01-13 Fri 16:55] =>  0:13
  


* TODO workflow test
- select a TODO task. 
- run org-start-pomodora
- auto record each pomodora
- allow org-intercept-pomodora
- utilize the table 


* TODO sample task 
  CLOCK: [2017-01-15 Sun 20:57]--[2017-01-15 Sun 20:58] =>  0:01



#+BEGIN: clocktable :maxlevel 2 :scope subtree
#+CAPTION: Clock summary at [2017-01-15 Sun 20:58]
| Headline         | Time   |
|------------------+--------|
| *Total time*     | *0:01* |
|------------------+--------|
| TODO sample task | 0:01   |
#+END:



| <25> task name            | <25>  status              |
|---------------------------+---------------------------|
| test1                     | [X][X][.][X]              |
| test2                     | [X]                       |
|                           |                           |



* new entry

* new entry

* 2017-01-16
  
* 2017-01-16
* content

#+NAME: pomodora
|       date | item               | status      |
|------------+--------------------+-------------|
| 2017-01-16 | content            | test....    |
| 2017-01-16 | content            | test....    |
| 2017-01-16 | content            | test....    |
| 2017-01-16 | content            | test....    |
| 2017-01-16 | content            | test....    |
| 2017-01-16 | content            | test....    |
| 2017-01-16 | content            | test....    |
| 2017-01-16 | TODO test item1    | test....    |
| 2017-01-16 | TODO sample task   | test....    |
| 2017-01-19 | TODO test item1    | test111.... |
| 2017-01-19 | new entry          | test111.... |
| 2017-01-19 | new entry          | test111.... |
| 2017-01-19 | new entry          | test111.... |
| 2017-01-19 | new entry          | test111.... |
| 2017-01-19 | new entry          | test111.... |
| 2017-01-19 | new entry          | test111.... |
| 2017-01-19 | new entry          | test111.... |
| 2017-01-19 | TODO sample task   | test111.... |
| 2017-01-19 | TODO workflow test | test111.... |
| 2017-01-19 | TODO test item1    | test111.... |



